Revit 2027 API
FabricationPartBrowserChangedEventArgs.GetAllSolutionsPartsTypeCounts Method
 Returns the total fabrication part type usage count in all routing solutions.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ElementId, int> GetAllSolutionsPartsTypeCounts()
Public Function GetAllSolutionsPartsTypeCounts As IDictionary(Of ElementId, Integer)
public:
IDictionary<ElementId^, int>^ GetAllSolutionsPartsTypeCounts()
member GetAllSolutionsPartsTypeCounts : unit -> IDictionary<ElementId, int>
Return Value
IDictionary<ElementId, Int32>
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace